In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
#pass a range of 3 continuous numbers to series. Set the index
ser1 = Series(np.arange(3),index = ['A','B','C'])

In [3]:
ser1

A    0
B    1
C    2
dtype: int64

In [5]:
#drop an index from a series: call DROP
ser1.drop('B')

A    0
C    2
dtype: int64

In [8]:
#drop an index from a DATAFRAME: call DROP
#create a dataframe. Call a range of 9 continous numbers. Reshape them into a 3x3 matrix.
dframe1 = DataFrame(np.arange(9).reshape((3,3)),index = ['SF','LA','NY'],columns = ['pop','size','year'])

In [9]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [11]:
#drop a row from a dataframe: call DROP and give the name of row
#drop the index-LA row
dframe1.drop('LA')
#drop doesn't permanently affect your original dataframe

    pop  size  year
SF    0     1     2
NY    6     7     8

In [12]:
#create a dataframe that is original dataframe without idex-LA row
dframe2 = dframe1.drop('LA')

In [13]:
dframe2

    pop  size  year
SF    0     1     2
NY    6     7     8

In [15]:
#original dframe 1 is still intact
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [17]:
#drop a column from a data frame: call DROP, give name of column, specify that column is axis=1
#drop column 'year' from dataframe 1. Have to specify the axis for the column. 
#by default, axis 0 is row, axis 1 is column
dframe1.drop('year',axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7